## Task

In this compulsory task you will clean the country column and parse the date column in the **store_income_data_task.csv** file.

In [258]:
import pandas as pd
import numpy as np
import fuzzywuzzy
from fuzzywuzzy import process
import chardet
from datetime import date

# Set seed for reproducibility
np.random.seed(0)

In [239]:
# Load up store_income_data.csv
df = pd.read_csv('store_income_data_task.csv')

1. Take a look at all the unique values in the "country" column. Then, convert the column to lowercase and remove any trailing white spaces.

In [240]:
# Convert to lower case
df['country'] = df['country'].str.lower()

In [241]:
# Remove trailing white spaces
df['country'] = df['country'].str.strip()

In [242]:
# Drop rows having null values
df.dropna()

,id,store_name,store_email,department,income,date_measured,country
3,4,FIRST REPUBLIC BANK,ecanadine3@fc2.com,Automotive,$8928350.04,8-5-2006,britain/
5,6,"Auburn National Bancorporation, Inc.",ccaldeyroux5@dion.ne.jp,Grocery,$69798987.04,19-9-1999,u.k.
6,7,"Interlink Electronics, Inc.",orodenborch6@skyrock.com,Garden,$22521052.79,8-6-2001,sa
9,10,"Synopsys, Inc.",lcancellieri9@tmall.com,Electronics,$44091294.62,11-7-2006,united kingdom
15,16,New Home Company Inc. (The),nhinchcliffef@whitehouse.gov,Shoes,$90808764.99,21-4-1993,britain
...,...,...,...,...,...,...,...
987,988,"Ares Dynamic Credit Allocation Fund, Inc.",fbrocklebankrf@sitemeter.com,Health,$34762898.80,15-12-1989,sa/
989,990,Madison Covered Call & Equity Strategy Fund,nbaikerh@list-manage.com,Electronics,$85704421.13,16-7-1993,uk.
991,992,"Atlantic Capital Bancshares, Inc.",mgribbellrj@symantec.com,Clothing,$83355366.27,13-4-2001,s.a..
995,996,Columbia Sportswear Company,cschooleyrn@sohu.com,Automotive,$52593924.99,7-10-2005,s. africasouth africa/
997,998,Tortoise Energy Infrastructure Corporation,cbeardshallrp@ow.ly,Health,$1697293.64,25-4-2009,united states of america

In [243]:
df['country'].unique()

array(['united states/', 'britain', 'united states', 'britain/',
       'united kingdom', 'u.k.', 'sa', 'u.k/', 'america', nan, 's.a.',
       'england', 'uk', 's.a./', 'u.k', 'america/', 'sa.', '', 'uk.',
       'england/', 'united states of america', 'uk/', 'sa/', 'england.',
       'america.', 's.a..', 'united states of america.',
       'united states of america/', 'united states.',
       's. africasouth africa', 'britain.', '/', 'united kingdom.',
       's. africasouth africa/', 'united kingdom/',
       's. africasouth africa.', '.'], dtype=object)

In [244]:
# Let us view the data
countries = df['country'].unique()
print(f"There are {len(countries)} unique countries")
countries

There are 37 unique countries

array(['united states/', 'britain', 'united states', 'britain/',
       'united kingdom', 'u.k.', 'sa', 'u.k/', 'america', nan, 's.a.',
       'england', 'uk', 's.a./', 'u.k', 'america/', 'sa.', '', 'uk.',
       'england/', 'united states of america', 'uk/', 'sa/', 'england.',
       'america.', 's.a..', 'united states of america.',
       'united states of america/', 'united states.',
       's. africasouth africa', 'britain.', '/', 'united kingdom.',
       's. africasouth africa/', 'united kingdom/',
       's. africasouth africa.', '.'], dtype=object)

In [245]:
# Get the top 10 closest matches to "united kingdom"
matches = fuzzywuzzy.process.extract("uk", countries, limit=10, scorer=fuzzywuzzy.fuzz.token_sort_ratio)

# Inspect matches
matches
df.head()

,id,store_name,store_email,department,income,date_measured,country
0,1,"Cullen/Frost Bankers, Inc.",NaN,Clothing,$54438554.24,4-2-2006,united states/
1,2,Nordson Corporation,NaN,Tools,$41744177.01,4-1-2006,britain
2,3,"Stag Industrial, Inc.",NaN,Beauty,$36152340.34,12-9-2003,united states
3,4,FIRST REPUBLIC BANK,ecanadine3@fc2.com,Automotive,$8928350.04,8-5-2006,britain/
4,5,Mercantile Bank Corporation,NaN,Baby,$33552742.32,21-1-1973,united kingdom

In [246]:
# Function to replace rows in the provided column of the provided DataFrame
# that match the provided string above the provided ratio with the provided string
def replace_matches_in_column(df, column, string_to_match, min_ratio = 90):
    # get a list of unique strings
    strings = df[column].unique()
    
    # Get the top 10 closest matches to our input string
    matches = fuzzywuzzy.process.extract(string_to_match, strings, 
                                         limit=10, scorer=fuzzywuzzy.fuzz.token_sort_ratio)

    # Only get matches with a ratio > 90
    close_matches = [matches[0] for matches in matches if matches[1] >= min_ratio]

    # Get the rows of all the close matches in our dataframe
    rows_with_matches = df[column].isin(close_matches)

    # Replace all rows with close matches with the input matches 
    df.loc[rows_with_matches, column] = string_to_match
    
    # Let us know when the function is done
    print("All done!")

In [247]:
# Replace the country column value with appropriate matched country names
replace_matches_in_column(df=df, column='country', string_to_match="united kingdom")
replace_matches_in_column(df=df, column='country', string_to_match="england")
replace_matches_in_column(df=df, column='country', string_to_match="united states")
replace_matches_in_column(df=df, column='country', string_to_match="united states of america")
replace_matches_in_column(df=df, column='country', string_to_match="america")
replace_matches_in_column(df=df, column='country', string_to_match="south africa")
replace_matches_in_column(df=df, column='country', string_to_match="s. africasouth africa")
replace_matches_in_column(df=df, column='country', string_to_match="s.a")
replace_matches_in_column(df=df, column='country', string_to_match="uk")
replace_matches_in_column(df=df, column='country', string_to_match="u.k")
replace_matches_in_column(df=df, column='country', string_to_match="britain")

All done!
All done!
All done!
All done!
All done!
All done!
All done!
All done!
All done!
All done!
All done!

2. Note that there should only be three separate countries. Eliminate all variations, so that 'South Africa', 'United Kingdom' and 'United States' are the only three countries.

In [248]:
# get all the unique values in the 'country' column
countries = df['country'].unique()

print(f"There are {len(countries)} unique countries")
countries

There are 17 unique countries

array(['united states', 'britain', 'united kingdom', 'u.k', 'sa',
       'america', nan, 's.a', 'england', 'uk', 'sa.', '',
       'united states of america', 'sa/', 's. africasouth africa', '/',
       '.'], dtype=object)

In [249]:
df.replace('britain', 'united kingdom', inplace=True)
df.replace('u.k', 'united kingdom', inplace=True)
df.replace('uk', 'united kingdom', inplace=True)
df.replace('england', 'united kingdom', inplace=True)
df.replace('united states of america', 'united states', inplace=True)
df.replace('america', 'united states', inplace=True)
df.replace('sa', 'south africa', inplace=True)
df.replace('s.a', 'south africa', inplace=True)
df.replace('sa.', 'south africa', inplace=True)
df.replace('s. africasouth africa', 'south africa', inplace=True)

In [250]:
# get all the unique values in the 'country' column
countries = df['country'].unique()

print(f"There are {len(countries)} unique countries")
countries

There are 8 unique countries

array(['united states', 'united kingdom', 'south africa', nan, '', 'sa/',
       '/', '.'], dtype=object)

3. Create a new column called `days_ago` in the DataFrame that is a copy of the 'date_measured' column but instead it is a number that shows how many days ago it was measured from the current date. Note that the current date can be obtained using `datetime.date.today()`.

In [251]:
# Create new column and assign 'date_measured'
df['days_ago'] = df['date_measured']

In [252]:
str(datetime.datetime.today()).split()[0]

'2024-04-29'

In [253]:
datetime.date.today()

datetime.date(2024, 4, 29)

In [254]:
datetime.date.today()

datetime.date(2024, 4, 29)

In [255]:
df['date_parsed'] = pd.to_datetime(df['date_measured'], format='%d-%m-%Y')

In [256]:
df.head()

,id,store_name,store_email,department,income,date_measured,country,days_ago,date_parsed
0,1,"Cullen/Frost Bankers, Inc.",NaN,Clothing,$54438554.24,4-2-2006,united states,4-2-2006,2006-02-04
1,2,Nordson Corporation,NaN,Tools,$41744177.01,4-1-2006,united kingdom,4-1-2006,2006-01-04
2,3,"Stag Industrial, Inc.",NaN,Beauty,$36152340.34,12-9-2003,united states,12-9-2003,2003-09-12
3,4,FIRST REPUBLIC BANK,ecanadine3@fc2.com,Automotive,$8928350.04,8-5-2006,united kingdom,8-5-2006,2006-05-08
4,5,Mercantile Bank Corporation,NaN,Baby,$33552742.32,21-1-1973,united kingdom,21-1-1973,1973-01-21

In [257]:
df['date_parsed'].dtype

dtype('<M8[ns]')